# Data Enrichment

# Mock Belt Exam (Practice)

- You will NOT have to make API calls on the exam
- Instead, you WILL be given a .json file that simulates the results of making API calls

## Task

Your task is to use your data science skills to help the Kiva crowdfunding organization create a MySQL database and to insert their internal API data on customer sales. They want you to do 3 things for them.

1) Design a MySQL Database schema to their specifications
2) Insert their internal API data into the database using Python (sqlalchemy)
3) Use SQL queries to answer the following questions:

- Q1: "What is the average funded amount for teams with at least 1 female borrower, and how many teams meet this criterion?"
- Q2: "What are the sectors for each team from Peru? Display the country and sector for teams in Peru, ordered by sector, in ascending order"
- Q3: "Which country received the highest funded amount? Display Country, sector, and its highest funded amount."

They have provided you with a .json file that can be found [here.](https://drive.google.com/file/d/1zyVYMuS8GsgoZhWQpBp-5ijlzS3FknKE/view?usp=sharing)

Make sure you:

- Work in a Jupyter notebook using the dojo-env within a PRIVATE github repo.
- Please name your repo using the following format: "First-Last__Mock-Exam" (Please make sure you use two underscores after your name)

### Extract:

- Explore the .json file in your Jupyter Notebook to find the results from previously made API calls.
- Separate the 4 sets of records within the ‘data’ master key into 4 pandas dataframes for processing.

### Transform:

- In the financials data:
    - remove ‘$’ from funded_amount
    - change funded_amount to numeric
- You do NOT need to normalize the tables/database.
- You do NOT need to do any other preprocessing/cleaning at this time.



### Design the MySQL Database and ERD:

Design the Database Model/ERD in MySQL Workbench to match the specs below:

- The schema/db name should be "mock_exam".

It should have the following specifications (you will add the data in a later step using Python):

- Table Specs:
    - "**use**" table:
        - id: INT
        - activity: VARCHAR(45)
        - sector: VARCHAR(45)
        - use: TEXT(300)
    - "**campaign**" table: (You will use data from the "crowd" key to fill in this table.
        - id: INT
        - posted_time: DATETIME
        - funded_time: DATETIME
        - lender_count: INT
    - "**demographics**"  table:
        - id: INT
        - country: VARCHAR(45)
        - region VARCHAR(100)
        - borrower_genders TEXT(400)
    - "**financials**" table:
        - id: INT
        - funded_amount: FLOAT
        - currency: CHAR(4)
        - term_in_months: INT
- <u>Relationships between tables</u>
    - NOTE: Our database will NOT be normalized, and we will use our tables "as is" for this activity.
- Make 1:n relationships from the campaign table using the dropper tool to connect tables using existing keys. ![img](https://assets.codingdojo.com/boomyeah2015/codingdojo/curriculum/content/chapter/1692818159__dropper.png)
    - campaign id to financials id
    - campaign id to demographics id
    - campaign id to use id



### Create the Empty Database

- Export the PNG, insert it into your repo folder, and show it in a Markdown cell in your notebook**.
- Export the Forward Engineering CREATE SQL Script and save it to your repository.
- Run the .sql script in MySQL Workbench to create the empty database structure.

### Load:

- NOTE: You are required to use credentials stored in a json file within a .secret folder to access MySQL in your notebook
- Use SQL alchemy in Python to connect to your database in your Jupyter Notebook.
- Run the "SHOW TABLES;" query after connecting to the database.
- Upload each of the four dataframes as separate tables into this database using SQLAlchemy
    - **For each of the 4 tables:**
        - Before adding data, run the "DESCRIBE table" command.
        - Change the dataframe datatype to match the data type of the table if needed.
        - Insert the data from the dataframes into the corresponding tables.
        - Make sure to keep the intended data types from your database.
        - After inserting the data, run the "DESCRIBE table" command again to confirm the columns and data types are correct.
        - Run a "SELECT * FROM table LIMIT 5" query (Hint: Be sure to use backticks around this table name `use`)

**After the 4 tables have been created:**

- Perform the “SHOW TABLES;” query again to show that the same 4 tables still exist.

### **Perform queries to answer the following questions:**

*HINT: Use the SQL alchemy text function to assist with executing queries that use the "%" operator*

![img](https://assets.codingdojo.com/boomyeah2015/codingdojo/curriculum/content/chapter/1692817946__Screenshot20230823at31138PM.png)

- Q1: "What is the average funded amount for teams with at least 1 female borrower, and how many teams meet this criterion?"
    - Hint: Your query should return just the calculated result and no other columns.
- Q2: "What are the sectors for each team from Peru? Display the country and sector for teams in Peru, ordered by sector, in ascending order"
- Q3: "Which country received the highest funded amount? Display Country, sector, and its highest funded amount."

### Final Deliverables:

- Add your .sql file and your .ipynb file to a PRIVATE github repository.
    - Please make sure your name has the following format: "First-Last__Mock-Exam" (Please make sure you use two underscores after your name).
- Download your final repository as a zip file on github.com (not from Github Desktop):



![img](https://assets.codingdojo.com/boomyeah2015/codingdojo/curriculum/content/chapter/1694024188__downloadrepoaszip.png)

- Submit the single zipped file.

## Submission Requirements:

Single zipped file from your github repository containing

- .ipynb notebook with all code included
- .sql file exported from MySQL workbench
- .png file with the ERD



___

# ETL of JSON File

In [1]:
import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats


import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus as urlquote

## Extract

In [2]:
## Loading json file
with open('Data/Mock_Crowdsourcing_API_Results.json') as f:
    results = json.load(f)
results.keys()

dict_keys(['meta', 'data'])

In [3]:
## explore each key 
type(results['meta'])

str

In [4]:
## display meta
results['meta']

'Practice Lesson: Mock API Call'

In [5]:
## display data
type(results['data'])

dict

In [6]:
## preview just the keys
results['data'].keys()

dict_keys(['crowd', 'demographics', 'financials', 'use'])

In [7]:
## what does the crowd key look like?
# results['data']['crowd']

In [8]:
## checking single entry of crowd
results['data']['crowd'][0]

{'id': 658776,
 'posted_time': '2014-01-17 21:21:10+00:00',
 'funded_time': '2014-02-05 17:57:55+00:00',
 'lender_count': 33}

In [9]:
from sqlalchemy.types import TEXT, VARCHAR, INTEGER, FLOAT, CHAR, DATETIME
# TEXT()

### Creating data frame of json data

In [10]:
## making crowd a dataframe
crowd = pd.DataFrame(results['data']['crowd'])
crowd.head()

        id                posted_time                funded_time  lender_count
0   658776  2014-01-17 21:21:10+00:00  2014-02-05 17:57:55+00:00            33
1  1314847  2017-06-07 02:02:41+00:00  2017-06-21 17:10:38+00:00             9
2   863063  2015-03-27 20:08:04+00:00  2015-04-04 15:01:22+00:00             1
3  1184347  2016-11-14 07:32:12+00:00  2016-11-25 03:07:13+00:00            47
4   729745  2014-06-24 07:35:46+00:00  2014-07-10 16:12:43+00:00            12

In [11]:
## making demographics a dataframe
demo = pd.DataFrame(results['data']['demographics'])
demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                10000 non-null  int64
 1   country           10000 non-null  object
 2   region            9194 non-null   object
 3   borrower_genders  9939 non-null   object
dtypes: int64(1), object(3)
memory usage: 312.6+ KB

In [12]:
## making financials a dataframe
financials = pd.DataFrame(results['data']['financials'])
financials.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              10000 non-null  int64
 1   funded_amount   10000 non-null  object
 2   currency        10000 non-null  object
 3   term_in_months  10000 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 312.6+ KB

In [13]:
## making use a dataframe
use = pd.DataFrame(results['data']['use'])
use.head()

,id,activity,sector,use
0,658776,Vehicle,Personal Use,to purchase a motorcycle in order to travel fr...
1,1314847,Pigs,Agriculture,to buy feed and other supplies like vitamins t...
2,863063,Bookstore,Retail,"to buy notebooks, pencils, and pens."
3,1184347,Photography,Services,to pay for a new lens for providing photograph...
4,729745,Fuel/Firewood,Retail,to buy firewood to sell.

## Transform

In [14]:
## fixing funded amount column
financials['funded_amount'] = financials['funded_amount'].str.replace('$','')
financials['funded_amount'] = pd.to_numeric(financials['funded_amount'])
financials

/var/folders/td/cybzgn316hq8r5cn05lb0y2m0000gn/T/ipykernel_13924/2638807975.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  financials['funded_amount'] = financials['funded_amount'].str.replace('$','')

           id  funded_amount currency  term_in_months
0      658776         1000.0      USD            20.0
1     1314847          225.0      PHP            13.0
2      863063         1150.0      PEN             6.0
3     1184347         1700.0      AMD            26.0
4      729745          400.0      UGX             8.0
...       ...            ...      ...             ...
9995   679499          400.0      PKR            12.0
9996   873525          375.0      KES            14.0
9997   917686         1375.0      XOF             8.0
9998   905789          450.0      PHP            13.0
9999  1216411          125.0      PHP            16.0

[10000 rows x 4 columns]

## Load

#### Create the Database ( Make sure to use dropper)

![png](Data/erd.png)

#### connect with SQL to load from database

In [15]:
## loading mysql credentials
with open('/Users/purvikansara/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [16]:
## creating connection to database with sqlalchemy
connection_str  = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/mockdec23"
engine = create_engine(connection_str)
conn = engine.connect()

In [17]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: 
    create_database(connection_str)
else: 
    print('The database already exists.')

The database already exists.

In [18]:
q = "SHOW TABLES"
pd.read_sql(q, conn)

  Tables_in_mockdec23
0            campaign
1        demographics
2          financials
3                 use

#### Insert internal API data into the database

#### Campaign Table

In [19]:
q = "DESCRIBE `campaign`"
pd.read_sql(q, conn)

          Field      Type Null  Key Default Extra
0            id       int   NO  PRI    None
1   posted_time  datetime  YES         None
2   funded_time  datetime  YES         None
3  lander_count       int  YES         None

In [20]:
q = "SHOW tables"
pd.read_sql(q, conn)

  Tables_in_mockdec23
0            campaign
1        demographics
2          financials
3                 use

In [21]:
crowd.dtypes

id               int64
posted_time     object
funded_time     object
lender_count     int64
dtype: object

In [22]:
crowd_dtypes = {'id':INTEGER(),
                'posted_time':DATETIME(),
                'funded_time': DATETIME(), 
                'lender_count': INTEGER()}

In [23]:

crowd.to_sql('campaign',conn, index=False, dtype=crowd_dtypes, if_exists = 'replace')

10000

In [24]:
q = "DESCRIBE `campaign`"
pd.read_sql(q, conn)

          Field      Type Null Key Default Extra
0            id       int  YES        None
1   posted_time  datetime  YES        None
2   funded_time  datetime  YES        None
3  lender_count       int  YES        None

In [25]:
q = "SELECT * FROM `campaign` LIMIT 5"
pd.read_sql(q, conn)

        id         posted_time         funded_time  lender_count
0   658776 2014-01-17 13:21:10 2014-02-05 09:57:55            33
1  1314847 2017-06-06 19:02:41 2017-06-21 10:10:38             9
2   863063 2015-03-27 13:08:04 2015-04-04 08:01:22             1
3  1184347 2016-11-13 23:32:12 2016-11-24 19:07:13            47
4   729745 2014-06-24 00:35:46 2014-07-10 09:12:43            12

##### Financials

In [26]:
q = "DESCRIBE financials"
pd.read_sql(q, conn)

            Field     Type Null  Key Default Extra
0              id      int   NO  PRI    None
1   funded_amount    float  YES         None
2        currency  char(4)  YES         None
3  term_in_months      int  YES         None

In [27]:
financials.dtypes

id                  int64
funded_amount     float64
currency           object
term_in_months    float64
dtype: object

In [28]:
financials_dtypes = {'id':INTEGER(),
                     'funded_amount':FLOAT(),
                     'currency':CHAR(3),
                     'term_in_months':INTEGER()}
financials_dtypes

{'id': INTEGER(),
 'funded_amount': FLOAT(),
 'currency': CHAR(length=3),
 'term_in_months': INTEGER()}

In [29]:
## saving dataframes to database
financials.to_sql('financials', conn, index=False, dtype=financials_dtypes, if_exists = 'replace')

10000

In [30]:
q = "DESCRIBE financials"
pd.read_sql(q, conn)

            Field     Type Null Key Default Extra
0              id      int  YES        None
1   funded_amount    float  YES        None
2        currency  char(3)  YES        None
3  term_in_months      int  YES        None

In [31]:
q = "SELECT * FROM financials LIMIT 5"
pd.read_sql(q, conn)

        id  funded_amount currency  term_in_months
0   658776         1000.0      USD              20
1  1314847          225.0      PHP              13
2   863063         1150.0      PEN               6
3  1184347         1700.0      AMD              26
4   729745          400.0      UGX               8

##### Use

In [32]:
q = "DESCRIBE `use`"
pd.read_sql(q, conn)

      Field         Type Null  Key Default Extra
0        id          int   NO  PRI    None
1  activity  varchar(45)  YES         None
2    sector  varchar(45)  YES         None
3       use         text  YES         None

In [33]:
use.dtypes

id           int64
activity    object
sector      object
use         object
dtype: object

In [34]:
use_dtypes = {'id':INTEGER(),
              'activity': VARCHAR(31),
              'sector': VARCHAR(15),
              'use': TEXT(300)
              }

In [35]:

use.to_sql('use', conn, index=False, dtype=use_dtypes, if_exists = 'replace')

10000

In [36]:
q = "DESCRIBE `use`"
pd.read_sql(q, conn)

      Field         Type Null Key Default Extra
0        id          int  YES        None
1  activity  varchar(31)  YES        None
2    sector  varchar(15)  YES        None
3       use         text  YES        None

In [37]:
q = "SELECT * FROM `use` LIMIT 5" 
pd.read_sql(q, conn)

,id,activity,sector,use
0,658776,Vehicle,Personal Use,to purchase a motorcycle in order to travel fr...
1,1314847,Pigs,Agriculture,to buy feed and other supplies like vitamins t...
2,863063,Bookstore,Retail,"to buy notebooks, pencils, and pens."
3,1184347,Photography,Services,to pay for a new lens for providing photograph...
4,729745,Fuel/Firewood,Retail,to buy firewood to sell.

##### demographics

In [38]:
q = "DESCRIBE `demographics`"
pd.read_sql(q, conn)

              Field          Type Null  Key Default Extra
0                id           int   NO  PRI    None
1           country   varchar(45)  YES         None
2            region  varchar(100)  YES         None
3  borrower_genders          text  YES         None

In [39]:
demo.dtypes

id                   int64
country             object
region              object
borrower_genders    object
dtype: object

In [40]:
demo_dtypes = {"id": INTEGER(),
               'country':VARCHAR(37),
               'region': VARCHAR(51),
               'borrower_genders': TEXT(400)}
demo_dtypes

{'id': INTEGER(),
 'country': VARCHAR(length=37),
 'region': VARCHAR(length=51),
 'borrower_genders': TEXT(length=400)}

In [41]:

demo.to_sql('demographics', conn, index=False, dtype=demo_dtypes, if_exists = 'replace')

10000

In [42]:
q = "DESCRIBE `demographics`"
pd.read_sql(q, conn)

              Field         Type Null Key Default Extra
0                id          int  YES        None
1           country  varchar(37)  YES        None
2            region  varchar(51)  YES        None
3  borrower_genders         text  YES        None

In [43]:
q = "SELECT * FROM `demographics` LIMIT 5"
pd.read_sql(q, conn)

,id,country,region,borrower_genders
0,658776,El Salvador,Ciudad El Triunfo,male
1,1314847,Philippines,"Bais, Negros Oriental",female
2,863063,Peru,Huarochiri,"female, female, female, female, female, female..."
3,1184347,Armenia,Vanadzor town,female
4,729745,Uganda,Masindi,female

## Final Table Check

In [44]:
## checking if tables created
q= '''SHOW TABLES;'''
pd.read_sql(q,conn)

  Tables_in_mockdec23
0            campaign
1        demographics
2          financials
3                 use

## Queries

### Q1: "What is the average funded amount for teams with at least 1 female borrower, and how many teams meet this criterion?"

In [45]:
## importing text function to use on query with a "%" in it
from sqlalchemy import text

In [46]:
## query to get campaigns that included female borrowers
q = '''SELECT 
    AVG(f.funded_amount) as `Average Funded Amount(includes female)`,
    COUNT(*)
FROM
    financials AS f
        JOIN
    demographics AS d ON f.id = d.id
WHERE
    d.borrower_genders LIKE "%female%";'''
female_df = pd.read_sql(text(q),conn)
female_df

   Average Funded Amount(includes female)  COUNT(*)
0                               771.01023      7820

### Q2: "What are the sectors for each team from Peru? Display the country and sector for teams in Peru, ordered by sector, in ascending order

In [47]:
q = """SELECT 
    d.country, `use`.sector
FROM
    demographics d
        JOIN
    campaign ON d.id = campaign.id
        JOIN
    `use` ON campaign.id = `use`.id
GROUP BY d.country , `use`.sector
HAVING d.country = 'Peru'
ORDER BY `use`.sector;"""
pd.read_sql(text(q), conn)

   country          sector
0     Peru     Agriculture
1     Peru            Arts
2     Peru        Clothing
3     Peru    Construction
4     Peru       Education
5     Peru            Food
6     Peru          Health
7     Peru         Housing
8     Peru   Manufacturing
9     Peru    Personal Use
10    Peru          Retail
11    Peru        Services
12    Peru  Transportation

### Q3: "Which country received the highest funded amount? Display Country, sector, and its highest funded amount."

In [48]:
q = """SELECT 
    d.country, `use`.sector, f.funded_amount
FROM
    `use`
        JOIN
    financials f ON `use`.id = f.id
        JOIN
    demographics d ON d.id = f.id
WHERE
    f.funded_amount = (SELECT 
            MAX(funded_amount)
        FROM
            financials);"""
pd.read_sql(text(q), conn)

  country       sector  funded_amount
0  Rwanda  Agriculture        50000.0